//11
//Завдання: Створити клас, який складається з виконавчого методу,
// що виконує обчислення значення функції.
// Результатом виконання дії є єдине значення дійсного типу.

//створюється клас з виконавчим методом calc який приймає char a, char b, char n, char m
// chars a, b числа з яких починається обрухунок, а на m та n закінчується
// для кожного числа заданного у вказаному проміжку виконується ((i/j)/(i-2)),
// для кожного числа з зовнішнього циклу виконується весь внутрішній
// результат додається до sum кожен раз поки не закінчиться зовнішній цикл

public class Lab1 {
    public static void main(String[] args){
        System.out.println(calc((char) 2, (char) 2, (char) 6, (char) 5));
    }
    static double calc(char a, char b, char n, char m) {
        double sum = 0;
        for (double i = a; i <= n; i++) {
            if (i == 2) continue;
            for (double j = b; j <= m; j++) {
                sum += ((i / j) / (i - 2));
            }
        }
        return sum;
    }
}

